Revit 2027 API
ParameterTypeId.CouplerNumber Property
 "Coupler Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerNumber { get; }
Public Shared ReadOnly Property CouplerNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerNumber {
	ForgeTypeId^ get ();
}
static member CouplerNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace